# In this notebook we use pandas
Pandas is great library to deal with data. 
Using notebooks and pandas is imo what everyone that is excel should be using instead...
With notebooks and pandas you have direct acces to actual coding, duh, and pandas, in my experience, allows for much larger datasets than excel ever could.

In [9]:
# We start by importing pandas
import pandas as pd

# We then create a simple dataframe
df = pd.DataFrame(
    [[173,"female",70],[185,"male",85],[168,"male",160]], 
    index = ["ava","ben","charlie"], columns = ["height", "sex", "deadlift"])

# Note how i broke the linea above in three, python lines can be broken if they are in parenthesis. 
# A line can also be broken using the "\" token.

# For example 
print 1, 2, 3, \
    4, 5, 6

1 2 3 4 5 6

In [11]:
# Here we have our dataframe, we will now do a series of operations on this dataframe
df

         height     sex  deadlift
ava         173  female        70
ben         185    male        85
charlie     168    male       160

In [28]:
# Mean, median, sum
print df.mean(), "\n",  df.median(),"\n", df.sum()

height      175.333333
deadlift    105.000000
dtype: float64
height      173.0
deadlift     85.0
dtype: float64
height                 526
sex         femalemalemale
deadlift               315
dtype: object

In [20]:
# We will now pivot the table using the sex column
df.pivot_table(columns = "sex", values = "deadlift")
# this gives us the mean for each sex, we could also use another aggregator function, for example sum, see next fram

sex
female     70.0
male      122.5
Name: deadlift, dtype: float64

In [26]:
# Summing over sex
df.pivot_table(columns = "sex", values = "deadlift", aggfunc = sum)

sex
female     70
male      245
Name: deadlift, dtype: int64

### We will now create a more larger dataframe
The dataset we are using the the titanic dataset. It is used in as a tutorial dataset at kaggle. 

A awsome tutorial on how to do machine learning using this dataset is available on: https://www.kaggle.com/helgejo/an-interactive-data-science-tutorial

In [32]:
url = "http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.csv"
df_titanic = pd.read_csv(url)

# Head shows you the top rows (default 5)
df_titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [33]:
# Now, instead of going through the means, sums and similar we can use the describe function
df_titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000